Revit 2027 API
BuiltInFailures.BendFailures.NotBentMaskingRegion Property
 While making curved beam type "[Type Name]" Masking Region elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentMaskingRegion { get; }
Public Shared ReadOnly Property NotBentMaskingRegion As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentMaskingRegion {
	FailureDefinitionId^ get ();
}
static member NotBentMaskingRegion : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace